package madasit;

/*
장난감
N개의 장난감이 있다. 각 장난감의 무게는 배열 W = [W[1], W[2], ..., W[N]] 에 의해 나타내어진다. 각 장난감을 사기 위해서는 1단위 가격이 필요하다. 만약 무게가 w인 장난감을 샀다면, 무게가 닫힌 구간 [w, w+4] 에 포함되는 모든 장난감들은 공짜다. 모든 장난감을 최소의 가격으로 사려면 어떻게 해야 할까?



입력

첫째 줄에 장난감의 개수 N이 주어진다. 둘째 줄에 무게 배열의 원소를 뜻하는 N개의 값이 주어진다.



출력

모든 장난감을 사기 위한 최소의 단위 가격을 출력하시오.



제한조건

1 <= N <= 100

0 <= W[i] <= 10000



입출력 예시 설명

첫번째 장난감을 1단위 가격으로 사면 두번째 장난감과 세번째 장난감은 무게가 [1, 5]에 포함되므로 공짜이다. 남은 두 장난감은 따로 산다.


입출력 예시

입력 예시 1
5
1 2 3 17 10
출력 예시 1
3
 */
public class Test3 {

	public static void main(String[] args) {
		
	}
}
