package madasit;

/*
전봇대
성남시의 성남대로는 직선으로 되어있는 도로이고 한 편에 전봇대가 임의의 간격으로 세워져 있다. 성남시에서는 전봇대들이 모두 같은 간격이 되도록 전봇대를 추가로 만드는 공사를 추진하고 있다. 성남시에서는 예산문제로 인해서 최소한의 전봇대를 추가로 만들고자 한다.

 

편의상 전봇대의 위치는 기준점으로부터 떨어져 있는 거리로 표현되며, 전봇대의 위치는 모두 양의 정수이다.

 

예를 들어, 전봇대가 (1, 3, 7, 13)의 위치에 있다면 (5, 9, 11)의 위치에 전봇대를 더 만들면 모든 전봇대들의 간격이 같게 된다. 또한, 전봇대가 (2, 5, 11, 17)에 있다면 (8, 14)에 전봇대를 더 만들어야 한다.

 

심어져 있는 전봇대의 위치가 주어질 때, 모든 전봇대가 같은 간격이 되도록 새로 만들어야 하는 전봇대의 최소수를 구하는 프로그램을 작성하라. 단, 추가되는 전봇대는 기존의 전봇대들 사이에만 만들 수 있다.



입력

첫째 줄에는 이미 만들어져 있는 전봇대의 수를 나타내는 하나의 정수 N이 주어진다

(3 <= N <= 100,000). 

둘째 줄부터 N개의 줄에 이미 만들어져 있는 전봇대의 위치가 출력되며, 전봇대의 위치를 나타내는 정수는 100,000,000 이하의 양의 정수이다. 

전봇대의 위치를 나타내는 정수는 모두 다르다.



출력

모든 전봇대가 같은 간격이 되도록 새로 만들어져야 하는 전봇대의 최소수를 첫 번째 줄에 출력한다.


입출력 예시

입력 예시 1
4
1
3
7
13
출력 예시 1
3
 */
public class Test4 {

	public static void main(String[] args) {
		
	}
}
